04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/hopperParticles/hopperInitialState/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

units [mm];

vertices
(
    (0 77.9423 6.2)
    (135 0 6.2)
    (165 0 6.2)
    (300 77.9423 6.2)
    (300 500 6.2)
    (0 500 6.2)
    (0 77.9423 0)
    (135 0 0)
    (165 0 0)
    (300 77.9423 0)
    (300 500 0)
    (0 500 0)
);


blocks
(
    hex (6 9 10 11 0 3 4 5 ) (20 40 1) simpleGrading (1 1 1)
    hex (7 8 9 6 1 2 3 0) (20 8 1) simpleGrading (1 1 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (1 7 8 2)
            (0 6 7 1)
            (2 8 9 3)
            (0 5 11 6)
            (3 4 10 9)
            (4 10 11 5)
        );
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (0 3 4 5)
            (1 2 3 0)
            (6 11 10 9)
            (6 9 8 7)
        );
    }
);


// ************************************************************************* //
